app/Controllers/Areas.php

SELECT *
FROM `areas`
ORDER BY `name` ASC
---
    public function index(){
        $areas = new AreaModel();

        $data['areas'] = $areas->orderBy('name', 'ASC')->findAll();

INSERT INTO `areas` (`name`, `nro_empleados`) VALUES ('Software', 0)
---
    public function store() {
        $area = new AreaModel();

        $data = [
            'name' => $this->request->getVar('name'),
            'nro_empleados'  => 0,
        ];

        $area->insert($data);

SELECT *
FROM `empleados`
WHERE `area_id` = '2'
 LIMIT 1
DELETE FROM `areas`
WHERE `id` = '2'
AND `id` IN ('2')
---
    public function delete(){
        $id = $this->request->getVar('area_id');

        $empleado = new EmpleadoModel();
        $area = new AreaModel();

        $empObj = $empleado->where('area_id', $id)->first();

        if(isset($empObj)){
            session()->setFlashdata("warning", 'La información no ha podido ser eliminada');
            return $this->response->redirect(base_url('/areas-list'));
        }else{
            $area->where('id', $id)->delete($id);