app/Controllers/Empleados.php

SELECT *
FROM `areas`
ORDER BY `name` ASC
---
    public function create(){
        $areas = new AreaModel();
        $data['areas'] = $areas->orderBy('name', 'ASC')->findAll();

INSERT INTO `empleados` (`name`, `email`, `birth_date`, `area_id`) VALUES ('Felo Perez', 'raybe92@gmail.com', '12-12-1990', '3')
SELECT *
FROM `areas`
WHERE `areas`.`id` = '3'
UPDATE `areas` SET `nro_empleados` = 1
WHERE `areas`.`id` IN ('3')
---
    public function store() {
        $empleados = new EmpleadoModel();
        $area = new AreaModel();

        $data = [
            'name' => $this->request->getVar('name'),
            'email'  => $this->request->getVar('email'),
            'birth_date'  => $this->request->getVar('birth_date'),
            'area_id'  => $this->request->getVar('area_id'),
        ];

        $empleados->insert($data);

        $areaObj = $area->find($this->request->getVar('area_id'));

        $id = $areaObj['id'];
        $nro_empleados = $areaObj['nro_empleados'] + 1;

        $data = [
            'nro_empleados' => $nro_empleados,
        ];
        $area->update($id, $data);

SELECT *
FROM `empleados`
WHERE `email` = 'raybe92@gmail.com'
 LIMIT 1
---
    public function get_email($email)
    {
        $empleado = new EmpleadoModel();

        $email = $empleado->where('email', $email)->first();